app/views/restaurants/index.html.haml

    %h2= "Reviews:"
    - restaurant.reviews.each do |review|
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."restaurant_id" = $1  [["restaurant_id", 10]]