app/controllers/restaurants_controller.rb

  def create
    @restaurant = Restaurant.new(restaurant_params)
    if @restaurant.save
---
INSERT INTO "restaurants" ("name", "created_at", "updated_at", "description") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "KFC"], ["created_at", 2017-02-22 09:17:45 UTC], ["updated_at", 2017-02-22 09:17:45 UTC], ["description", ""]]

  def update
    @restaurant = Restaurant.find(params[:id])
    @restaurant.update(restaurant_params)
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "restaurants" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "restaurants"."id" = $4  [["name", "Taro"], ["description", "Sushi"], ["updated_at", 2017-02-22 09:20:00 UTC], ["id", 2]]