app/controllers/reviews_controller.rb

  def create
    @restaurant = Restaurant.find(params[:restaurant_id])
    @review = @restaurant.reviews.new(review_params)
    @review.user = current_user
    @review.save
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
INSERT INTO "reviews" ("thoughts", "rating", "created_at", "updated_at", "restaurant_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["thoughts", "so so"], ["rating", 3], ["created_at", 2017-02-22 10:18:34 UTC], ["updated_at", 2017-02-22 10:18:34 UTC], ["restaurant_id", 5]]